# Сформировать и вывести список размера 10 содержащий первые 10 членов данной прогрессии: А + D * n
while True:
    try:  # обработка исключений
        A = int(input('Введите член А арифметической последовательности: '))  # Ввод числа
        D = int(input('Введите разность арифметической последовательности: '))  # Ввод числа
        break
    except ValueError:
        print("Не корректный ввод, попробуйте еще раз!")

list_p = []
for i in range(10):
    list_p.append(A + D * i)

print(list_p)
